# 数据类型

[toc]

## string 字符串

### 字符串操作

- 设置key及值，过期时间可以使用秒或毫秒为单位

`set key value [ex seconds] [px milliseconds] [nx|xx]`     

- 从偏移量开始复写key的特定位的值

`setrange key offset value`

```bash
> set first "hello world"       #设置first变量
> get first
"hello world"
> setrange first 6 "Redis"     #从第7位开始改写
> get first
"hello Redis"
```

- 统计字串长度

`strlen key`

```bash
192.168.4.50:6350> STRLEN name
(integer) 8
192.168.4.50:6350> get name
"feng***n"
```

- 追加值

存在则追加，不尊在则创建key及value，返回key长度

`append key value`

```bash
192.168.4.50:6350> get b
"20000"
192.168.4.50:6350> append b s
(integer) 6
192.168.4.50:6350> get b
"20000s"

192.168.4.50:6350> keys *    #查看key统计，没有kaka
1) "Linux"
2) "b"
3) "name"
4) "first"

192.168.4.50:6350> APPEND kaka yes  #append命令追加kaka及赋值，直接完成
(integer) 3
192.168.4.50:6350> get kaka
"yes"
192.168.4.50:6350> 
```

- 位存储
  - 对key所存储字串，设置或清除特定偏移量上的位(bit)
  - value值可以为1或0，offset为0~2^32之间
  - key不存在，则创建新key


`setbit key offset value`

- 
  - 统计字串中被设置为1的比特位数量
  `bitcount key`

> 场景说明：
>
> 记录网站用户上线频率，如A用户上线了多少天等类似数据
>
> 如用户在某天上线，则使用setbit，以用户名为key，上线日为offset，设置值为1，没上线为0，最后计算上线总次数时，使用bitcount 用户名即可
>
> 这样，即是网站运行10年，每个yoghurt仅占用10*365比特位即456字节。

```bash
> setbit nb 0 1   #设置bit第0位为1
> setbit nb 1 0   #设置bit第1位为0
> setbit nb 2 0
> setbit nb 3 1
> setbit nb 4 1
> setbit nb 5 0
> setbit nb 6 1
> setbit nb 7 1

> BITCOUNT nb     #统计变量nb中bit位为1的数量
(integer) 5
```

- 值的自减

将key中的值减1，key不存在则先初始化为0，再-1

`decrby key decrement`

将key中的值，减去decrement

`decr key`

```bash
192.168.4.50:6350> decr lili 
(integer) -1
192.168.4.50:6350> get lili
"-1"

192.168.4.50:6350> decrby lili 10
(integer) -11
192.168.4.50:6350> get lili
"-11"
```

- 值的自增

将key的值加1，如果key不存在，则初始为0后再+1

主要应用为计数器

`incr key`

将key 的值增加increment

`incrby key increment`

```bash
192.168.4.50:6350> set gg 10
OK
192.168.4.50:6350> incr gg
(integer) 11
192.168.4.50:6350> incr gg
(integer) 12
192.168.4.50:6350> get gg
"12"
192.168.4.50:6350> incrby gg 20
(integer) 32
192.168.4.50:6350> get gg
"32"
```

- 值的自增（浮点数增量）

为key中所存储的值加上浮点数增量increment

`incrbyfloat key increment`

```bash
192.168.4.50:6350> set fg 11.1
OK
192.168.4.50:6350> incrbyfloat fg 2.2
"13.3"
```

- 截取值的范围输出

返回字串值中的子字串，截取范围为start和end

负数偏移量表示从末尾开始计数，-1表示最后一个字符，-2表示倒数第二个字符

`getrange key start end`

```bash
192.168.4.50:6350> set qq 12345678
OK
192.168.4.50:6350> getrange qq 1 -1
"2345678"
192.168.4.50:6350> getrange qq 5 7
"678" 
```

## List 列表

- Redis的list是一个字符队列

- 先进后出
- 一个key可以有多个值

> 先进后出：
>
> 最先输入的变量值，输出的时候在最后

### list列表操作

- lpush 创建列

将一个或多个值value插入到列表key的表头

key不存在，则创建key

`lpush key value [value...]`

```bash
192.168.4.50:6350> lpush list a b c d e 
(integer) 5
```

- lrange 读取列

从开始位置读取key的值到stop结束

`lrange key start stop`

```bash
192.168.4.50:6350> lrange list 0 -1
1) "e"
2) "d"
3) "c"
4) "b"
5) "a"
#输出的值遵循先进后出原则
```

- lpop 移除值

移除并返回输出列表头元素数据（第一位值，也就是最后赋予的值，也就是最新的变量的值），key不存在则返回nil

`lpop key`

```bash
192.168.4.50:6350> lrange list 0 -1
1) "ff"
2) "e"
3) "d"
4) "c"
5) "b"
6) "a"
192.168.4.50:6350> lpop list  # 删除头部值
"ff"
192.168.4.50:6350> lpop list   #删除头部值
"e"
```

- llen 显示列表长度

返回列表key 的长度

`llen key`

- 列出列表中的第x个值

返回列表中第index个值

`lindex key index`

```bash
192.168.4.50:6350> lindex list 2
"b"
192.168.4.50:6350> lindex list 3
"a"
```

- 修改列中某一个值

将key中index位置的值修改位value

`lset key index value`

```bash
192.168.4.50:6350> lrange list 0 -1  #查看列中的值
1) "g"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "a"
192.168.4.50:6350> lset list 0 ggg #变更第1位值为ggg
OK
192.168.4.50:6350> lset list -1 aaa
OK
192.168.4.50:6350> lrange list 0 -1 #变更最后一位值为aaa
1) "ggg"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "aaa"
```

- 在队尾插入值/删除值

将value插入到key的末尾

`rpush key value [value...]`

删除并返回key末尾的值

`rpop key`

```bash
192.168.4.50:6350> lrange list 0 -1
1) "ggg"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "aaa"
192.168.4.50:6350> rpop list 
"aaa"
192.168.4.50:6350> rpush list aaa
(integer) 7
192.168.4.50:6350> lrange list 0 -1
1) "ggg"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "aaa"
```



## hash表

- Redis hash

> 一个变量可以存储多列，每列对应一个值

是一个string类型的field和value的映射表

一个key可对应多个field，一个field对应一个value

将一个对象存储为hash类型，较于每个字段都存储成string类型更能节省内存

### hash表操作

- 创建

将hash表中的field值设置为value

`hset key field value`

```bash
> HSET site baidu www.baidu.com
```

- 获取列的值

获取hash表中field的值

`hget key field`

```bash
> hget site baidu
"www.baidu.com"
```

- 给多个列赋值

同时给hash表中的多个field赋值

`hmset key field value [field value..]`

```bash
> hmset site 163 www.163.com zhihu www.zhihu.com
OK
```

- 输出表中多个列的值

返回hash表中多个field值

`hmget key field [field...]`

```bash
> hmget site baidu 163 zhihu
1) "www.baidu.com"
2) "www.163.com"
3) "www.zhihu.com"
```

- 输出表中所有列的名称

返回hash表中所有field名称

`hkeys key`

```bash
192.168.4.50:6350> hkeys site
1) "baidu"
2) "163"
3) "zhihu"
```

- 输出表中的所有列和值

`hgetall key`

```bash
192.168.4.50:6350> hgetall site
1) "baidu"
2) "www.baidu.com"
3) "163"
4) "www.163.com"
5) "zhihu"
6) "www.zhihu.com"
```

- 输出表中所有列的值

`hvals key`

- 删除表中多个列的值，不存在则忽略

`hdel key field [field...]`

```bash
192.168.4.50:6350> hdel site baidu 163
(integer) 2
192.168.4.50:6350> hgetall site
1) "zhihu"
2) "www.zhihu.com"
```

